# Код Морзе для представдения цифр и букв использует тире и точки.
# Напишите функцию для кодирования текстового сообщения в соответствии с кодом Морзе

morze = {'a': '•-', 'b': '-•••', 'c': '-•-•', 'd': '-••', 'e': '•', 'f': '••-•', 'g': '--•',
         'h': '••••', 'i': '••', 'j': '•---', 'k': '-•-', 'l': '•-••', 'm': '--', 'n': '-•',
         'o': '---', 'p': '•--•', 'q': '--•-', 'r': '•-•', 's': '•••', 't': '-', 'u': '••-',
         'v': '•••-', 'w': '•__', 'x': '-••-', 'y': '-•--', 'z': '--••',
         '0': '-----', '1': '.----'}


def recode(text):
    M = list(text.lower())
    a = ""
    for i in range(len(M)):
        a = a + morze.get(M[i])
    print(a)


recode(text=input('введите текст:'))
